In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

### 문제 1.a

In [4]:
iris = sns.load_dataset('iris')
iris_stats = iris.groupby(iris.species).describe()
iris_stats

           sepal_length                                              \
                  count   mean       std  min    25%  50%  75%  max
species
setosa             50.0  5.006  0.352490  4.3  4.800  5.0  5.2  5.8
versicolor         50.0  5.936  0.516171  4.9  5.600  5.9  6.3  7.0
virginica          50.0  6.588  0.635880  4.9  6.225  6.5  6.9  7.9

           sepal_width         ... petal_length      petal_width         \
                 count   mean  ...          75%  max       count   mean
species                        ...
setosa            50.0  3.428  ...        1.575  1.9        50.0  0.246
versicolor        50.0  2.770  ...        4.600  5.1        50.0  1.326
virginica         50.0  2.974  ...        5.875  6.9        50.0  2.026


                 std  min  25%  50%  75%  max
species
setosa      0.105386  0.1  0.2  0.2  0.3  0.6
versicolor  0.197753  1.0  1.2  1.3  1.5  1.8
virginica   0.274650  1.4  1.8  2.0  2.3  2.5

[3 rows x 32 columns]

### 문제 1.b

In [44]:
setosa_list = iris_stats.T['setosa'].values.tolist()
sl = [setosa_list[k * 8:(k + 1) * 8] for k in range((len(setosa_list) + 8 - 1) // 8 )]
versi_list = iris_stats.T['versicolor'].values.tolist()
ve_l = [versi_list[k * 8:(k + 1) * 8] for k in range((len(versi_list) + 8 - 1) // 8 )]
virgin_list = iris_stats.T['virginica'].values.tolist()
vi_l = [virgin_list[k * 8:(k + 1) * 8] for k in range((len(virgin_list) + 8 - 1) // 8 )]

[[50.0, 5.005999999999999, 0.3524896872134512, 4.3, 4.8, 5.0, 5.2, 5.8],
 [50.0,
  3.428000000000001,
  0.3790643690962886,
  2.3,
  3.2,
  3.4,
  3.6750000000000003,
  4.4],
 [50.0,
  1.4620000000000002,
  0.1736639964801841,
  1.0,
  1.4,
  1.5,
  1.5750000000000002,
  1.9],
 [50.0, 0.2459999999999999, 0.10538558938004569, 0.1, 0.2, 0.2, 0.3, 0.6]]

In [47]:
abn_s = [sl[i][4] - (sl[i][6] - sl[i][4]) * 1.5 for i in range(len(sl))]
abn_ve = [ve_l[i][4] - (ve_l[i][6] - ve_l[i][4]) * 1.5 for i in range(len(ve_l))]
abn_vi = [vi_l[i][4] - (vi_l[i][6] - vi_l[i][4]) * 1.5 for i in range(len(vi_l))]

In [17]:
ref_iris = iris.set_index('species')
ref_iris

           sepal_length  sepal_width  petal_length  petal_width
species
setosa              5.1          3.5           1.4          0.2
setosa              4.9          3.0           1.4          0.2
setosa              4.7          3.2           1.3          0.2
setosa              4.6          3.1           1.5          0.2
setosa              5.0          3.6           1.4          0.2
...                 ...          ...           ...          ...
virginica           6.7          3.0           5.2          2.3
virginica           6.3          2.5           5.0          1.9
virginica           6.5          3.0           5.2          2.0
virginica           6.2          3.4           5.4          2.3
virginica           5.9          3.0           5.1          1.8

[150 rows x 4 columns]

In [24]:
setosa = ref_iris.loc['setosa', :].sort_values(by='sepal_length', ascending=False)
ref_setosa =

         sepal_length  sepal_width  petal_length  petal_width
species
setosa            5.8          4.0           1.2          0.2
setosa            5.7          3.8           1.7          0.3
setosa            5.7          4.4           1.5          0.4
setosa            5.5          3.5           1.3          0.2
setosa            5.5          4.2           1.4          0.2
setosa            5.4          3.4           1.5          0.4
setosa            5.4          3.9           1.7          0.4
setosa            5.4          3.4           1.7          0.2
setosa            5.4          3.9           1.3          0.4
setosa            5.4          3.7           1.5          0.2
setosa            5.3          3.7           1.5          0.2
setosa            5.2          4.1           1.5          0.1
setosa            5.2          3.4           1.4          0.2
setosa            5.2          3.5           1.5          0.2
setosa            5.1          3.4           1.5          0.2
setosa            5.1          3.5           1.4          0.3
setosa            5.1          3.8           1.5          0.3
setosa            5.1          3.7           1.5          0.4
setosa            5.1          3.8           1.9          0.4
setosa            5.1          3.3           1.7          0.5
setosa            5.1          3.8           1.6          0.2
setosa            5.1          3.5           1.4          0.2
setosa            5.0          3.4           1.6          0.4
setosa            5.0          3.2           1.2          0.2
setosa            5.0          3.5           1.3          0.3
setosa            5.0          3.5           1.6          0.6
setosa            5.0          3.0           1.6          0.2
setosa            5.0          3.3           1.4          0.2
setosa            5.0          3.6           1.4          0.2
setosa            5.0          3.4           1.5          0.2
setosa            4.9          3.1           1.5          0.2
setosa            4.9          3.6           1.4          0.1
setosa            4.9          3.1           1.5          0.1
setosa            4.9          3.0           1.4          0.2
setosa            4.8          3.0           1.4          0.1
setosa            4.8          3.4           1.6          0.2
setosa            4.8          3.4           1.9          0.2
setosa            4.8          3.1           1.6          0.2
setosa            4.8          3.0           1.4          0.3
setosa            4.7          3.2           1.6          0.2
setosa            4.7          3.2           1.3          0.2
setosa            4.6          3.6           1.0          0.2
setosa            4.6          3.4           1.4          0.3
setosa            4.6          3.1           1.5          0.2
setosa            4.6          3.2           1.4          0.2
setosa            4.5          2.3           1.3          0.3
setosa            4.4          2.9           1.4          0.2
setosa            4.4          3.2           1.3          0.2
setosa            4.4          3.0           1.3          0.2
setosa            4.3          3.0           1.1          0.1

### 연습문제 2.a

In [65]:
titanic = sns.load_dataset('titanic')

In [66]:
titanic['category1'] = titanic.apply(lambda r: 'child' if r.age < 20 else r.sex, axis=1)

In [67]:
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,female
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

### 연습문제 2.b

In [68]:
mean_age = round(titanic.age.mean(), 0)
titanic['age'] = titanic.age.fillna(mean_age)

In [69]:
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,30.0,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,female
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

### 연습문제 2.c

In [73]:
sur_pct = titanic.pivot_table('survived', index=['sex', 'class', 'embark_town'])
sur_pct = (sur_pct * 100).round(2)
sur_pct

                           survived
sex    class  embark_town
female First  Cherbourg       97.67
              Queenstown     100.00
              Southampton     95.83
       Second Cherbourg      100.00
              Queenstown     100.00
              Southampton     91.04
       Third  Cherbourg       65.22
              Queenstown      72.73
              Southampton     37.50
male   First  Cherbourg       40.48
              Queenstown       0.00
              Southampton     35.44
       Second Cherbourg       20.00
              Queenstown       0.00
              Southampton     15.46
       Third  Cherbourg       23.26
              Queenstown       7.69
              Southampton     12.83

In [77]:
round(sur_pct.groupby('sex')[['survived']].mean(), 2)

        survived
sex
female     84.44
male       17.24

In [78]:
round(sur_pct.groupby('class')[['survived']].mean(), 2)

        survived
class
First      61.57
Second     54.42
Third      36.54

In [79]:
round(sur_pct.groupby('embark_town')[['survived']].mean(), 2)

             survived
embark_town
Cherbourg       57.77
Queenstown      46.74
Southampton     48.02

### 연습문제 2.d

In [82]:
ages = list(titanic.age)
bins = [1, 20, 30, 50, 70, 100]
labels = ['미성년자', '청년', '중년', '장년', '노년']
cats = pd.cut(ages, bins, labels=labels)
titanic['age_cats'] = cats

In [85]:
round(titanic.pivot_table('survived', index=['age_cats']) * 100, 2)

          survived
age_cats
미성년자         42.42
청년           33.42
중년           42.32
장년           35.59
노년           20.00

### 연습문제 2.e

In [88]:
cats2 = pd.qcut(ages, 3, labels=['Q1', 'Q2', 'Q3'])
titanic['age_cats2'] = cats2

In [90]:
round(titanic.pivot_table(['adult_male', 'survived'], index=['age_cats2']) * 100, 2)

           adult_male  survived
age_cats2
Q1              46.18     41.20
Q2              68.09     33.55
Q3              66.78     40.56

### 연습문제 3.a

In [111]:
mpg = sns.load_dataset('mpg')
mpg

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10

In [112]:
mpg['hp_per_cc'] = mpg['horsepower'] / mpg['displacement']
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,hp_per_cc
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu,0.423453
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320,0.471429
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite,0.471698
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst,0.493421
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino,0.463576

### 연습문제 3.b

In [120]:
li = mpg.name.tolist()
lis = [li[i].split() for i in range(len(li))]
manu = [lis[i][0] for i in range(len(lis))]
model = [lis[i][1:] for i in range(len(lis))]
model_n = [" ".join(model[i]) for i in range(len(model))]

In [121]:
mpg['manu'] = manu
mpg['model'] = model_n
mpg.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,hp_per_cc,manu,model
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl,0.614286,ford,mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup,0.536082,vw,pickup
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage,0.622222,dodge,rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger,0.658333,ford,ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10,0.689076,chevy,s-10

In [122]:
del mpg['name']
mpg.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,hp_per_cc,manu,model
393,27.0,4,140.0,86.0,2790,15.6,82,usa,0.614286,ford,mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,europe,0.536082,vw,pickup
395,32.0,4,135.0,84.0,2295,11.6,82,usa,0.622222,dodge,rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,0.658333,ford,ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,0.689076,chevy,s-10

### 연습문제 3.c

In [127]:
mpg['mpg/cy'] = mpg['mpg'] / mpg['cylinders']
round(mpg['mpg/cy'].mean(), 2)

5.05

### 연습문제 3.d

In [129]:
o = mpg.pivot_table('hp_per_cc', index=['origin'])
o

        hp_per_cc
origin
europe   0.740005
japan    0.789485
usa      0.512063

In [130]:
o.hp_per_cc.mean()

0.6805173970687347

### 연습문제 3.e

In [148]:
manu_group = mpg.groupby('manu')
manu_group.count()
manu_model = manu_group.count()['model']
manu_model2 = manu_model.tolist()
p = mpg.pivot_table('mpg', index=['manu'])
p['model_count'] = manu_model2
p = p[p.model_count >= 5]
p = p.sort_values(by='mpg', ascending=False)
p.iloc[:3, 0:]

               mpg  model_count
manu
vw       39.016667            6
honda    33.761538           13
renault  32.880000            5